---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataSpecification
source: html/4f5f853b-ae7d-360b-a2c8-4dc697c627eb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataSpecification Property

"Product Specification Description"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductDataSpecification { get; }
```